{
  "header": {
    "menu" : {
      "home": "Home",
      "about": "About",
      "skill": "Skill",
      "experience": "Experience",
      "repository": "Repository",
      "contact": "Contact"
    }
  },
  "home": {
    "greeting": "Hi there, I'm",
    "position": {
      "top": "Software",
      "bottom": "Developer"
    },
    "maxim": "Who delivers high-quality solutions that exceed expectations and drive success.",
    "explore": "Explore now"
  },
  "about": {
    "title": "ABOUT",
    "content": "Hi, I'm Nguyen Minh Chau. I'm a Software Developer with 2 years of experience in developing and maintaining software applications. I have a strong foundation in Java, JavaScript & TypeScript, Python and PHP. I have worked on projects involving React, Spring boot, Yii2, NestJS. I am passionate about creating efficient and scalable software solutions.",
    "viewCv": "View CV"
  },
  "skill": {
    "title": "SKILL",
    "softwareDeveloper": "As a Software Developer, I specialize in designing, coding, and maintaining software applications that meet user needs and enhance operational efficiency. My expertise spans various programming languages and frameworks, allowing me to create robust, scalable solutions. I am adept at collaborating with cross-functional teams to gather requirements, troubleshoot issues, and implement innovative features. My commitment to best practices in software development, including version control, testing, and documentation, ensures high-quality deliverables. I am passionate about continuous learning and staying updated with industry trends to leverage the latest technologies in my projects.",
    "webDevelopment": "As a Web Developer, I focus on creating dynamic and responsive web applications that deliver exceptional user experiences. My expertise includes HTML, CSS, JavaScript and Java, along with frameworks like ReactJS and Spring. I am skilled in both front-end and back-end development, allowing me to build seamless interfaces and robust server-side functionalities. Collaborating closely with designers and clients, I strive to translate requirements into engaging websites that meet business goals. I am passionate about web standards, accessibility, and performance optimization, ensuring that my projects are not only visually appealing but also user-friendly across all devices."
  }
}